<?php

namespace Database\Seeders;

use App\Helpers\Helper;
use App\Models\Book;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $books = ['Аз хуб ба олӣ', 'Аз худ шурӯъ намо', 'Боғи шафтолу', 'Динам ишқ аст', 'Роз', 'Сафири Симурғ', 'Биандешеду сарватманд шавед', '7 одати мардумони муассир', 'Падари сарватманд, падари фақир', 'Сарватмандтарин марди Бобил', 'Чӣ тавр ташвишу ҳаяҷонро пушти сар кунем то ҳаётамон орому шод гузарад?', 'Қурбоққаро қурт бидеҳ!', 'Ойини дӯстёбӣ', 'Девори Хуросон'];
        $descriptions = [
            'Китоби “Аз хуб ба олӣ” бо ҷумлаи «хуб, душман олӣ аст», оғоз мешавад, ки  ба мухотабон ин нуктаро ёдоварӣ мекунад, ки чаро талош накунем, аз хуб ба олӣ бирасем? Муаллиф бо тарҳи ин савол, ки «он даста, ки хуб будаанд, вале олӣ набудаанд, чигуна метавонанд ба марҳалаи олӣ будан  иқдом кунанд?»  бо мсилҳои мушаххас баҳс мекунад.',
            //2
            'Книга — один из видов печатной продукции: непериодическое издание, состоящее из сброшюрованных или отдельных бумажных листов (страниц) или тетрадей, на которых нанесена типографским или рукописным способом текстовая и графическая (иллюстрации) информация, имеющее, как правило, твёрдый переплёт',
            //3
            'Книга — один из видов печатной продукции: непериодическое издание, состоящее из сброшюрованных или отдельных бумажных листов (страниц) или тетрадей, на которых нанесена типографским или рукописным способом текстовая и графическая (иллюстрации) информация, имеющее, как правило, твёрдый переплёт',
            //4
            'Книга — один из видов печатной продукции: непериодическое издание, состоящее из сброшюрованных или отдельных бумажных листов (страниц) или тетрадей, на которых нанесена типографским или рукописным способом текстовая и графическая (иллюстрации) информация, имеющее, как правило, твёрдый переплёт',
            //5
            'Дар муҳтавои китоби Роз ва  ҳар сатру ҷумлаи он талоши нависанда Ронда Берн, ин будааст, ки  то дар мавзӯи сарнавишти Инсони комил суҳбат кунад ва зиндагии фардиро мавриди нақд қарор диҳад. Ронда Берн дар китоби “Роз” дарҳои ҷадид аз тафаккур ва нерӯи зеҳнро ба рӯйи хонандагони худ кушӯдааст, роҳе, ки ин китоб ба зоҳир содаро бисёр хонданӣ ва ҷаззоб карда ва то поёни достони Роз мутаваҷҷеҳ ин амр нахоҳед шуд.',
            //6
            'Книга — один из видов печатной продукции: непериодическое издание, состоящее из сброшюрованных или отдельных бумажных листов (страниц) или тетрадей, на которых нанесена типографским или рукописным способом текстовая и графическая (иллюстрации) информация, имеющее, как правило, твёрдый переплёт',
            //7 
            'Наполеон Ҳилл бо илҳом аз устодаш А. Карнеги, ки рамзи муваффақияти худро барои ӯ шарҳ дода буд, китоби “Биандешеду сарватманд шавед”-ро навиштааст. Ҳилл барои навиштани ин китоб   муддати 20 сол ба таҳлили зиндагии сад марди номӣ пардохта ва ҳосили онро ба сурати 13 қадам барои расидан ба сарват шарҳ додааст.',
            //8
            'Мо махлуқоте ҳастем, ки одатҳое дорем ва бидуни он одатҳо наметавонем зиндагонӣ кунем. Баъзе аз ин одатҳои бад ва ногуворанд, ки бояд ислоҳ шаванд; Бархеи дигар хуб ҳастанд, ки бояд беҳбуд ёбанд ва шуморае ҳам олӣ, ки бояд ба дарҷаи камол брсанд. Доктор Кови Стивен муҳаққиқ ва нависандаи барҷастаи аср мо дар ин китоб, бо нигоҳи жарфу амиқ «ҳафт одат»-и  асосии мардумони комёби ҷаҳонро  таҳлил карда ва сипас шеваи парвариш ва омӯхтани ин «ҳафт одат»-ро бо мо дар миён мегузорад',
            //9 
            'Мафҳум сарват ва дороӣ чист ? Чӣ касеро сарватманд меноманд? Китоби “Падари сарватманд, падари фақир”  ба ҳамаин ин ва дигар саволҳо посух  мегӯяд...', 
            //10
            'Китоби “Сарватмандтарин марди Бобил” маҷмӯае аз достонҳои  воқеӣ аст, ки ҳам аз лиҳози адабӣ ва ҳам ба лиҳози роҳнамоиҳои молӣ ва иқтисодӣ ҷолиби таваҷҷуҳ мебошад. Дар ҳама достонҳо омилҳои мушкилоти моли мавриди баррасӣ қарор гирифта ва роҳҳои амалии ҷолибе барои рафъи он пешниҳод шудааст. Ҳадафи  воқеӣ дар ин китоб дар он аст, ки алоқамандон ба муваффақияти молӣ ба кумаки он сарватманд шаванд, аз сарвати худ нигаҳдорӣ карда ва аз даромади ҳосили он сарват, сарвати бештаре ба даст оваранд.',
            //11
            'Ҳеҷ кас дар ин дунё ҷовидонӣ нест. Мо ҳамагӣ чанд даҳсола дар ин олами пир меҳмонем ва чӣ бояд кард, ки ин муддатро сазовору арзанда пушти сар кунем, ягон лаҳзаро аз ин соатҳо ва рӯзҳои қимматбаҳо беҳуда нагузаронем, доимо андешаҳои бузург ва дилбастагиҳои ҳақиқӣ дошта бошем? Ана ба ин суол ҷавоб ёфтан мумкин аст аз ин китоб. Вале барои он ки ба ин ҳама ноил шавем, танҳо харидани ин ки-тоб ва сар-сарӣ хонданаш кифоя нест. Бояд онро дастури амал кард. Мо ҳатто гумон мекунем, ки барои як оила якто ин гуна китоб доштан кам аст. Ин китобро харидан яке аз бобарортарин хариди шумо хоҳад шуд. Бовар кунед!',
            //12
            'Шумо ҳеч вақт барои анҷоми тамоми корҳое, ки бояд анҷом бидиҳед, фурсати кофӣ надоред. Шумо ба маънои воқеии калима дар анбӯҳи корҳо, масъулиятҳои фардӣ, барномаҳо, рӯзномаҳо ва маҷаллаҳои зиёде, ки бояд бихонед ва китобҳое, ки рӯи ҳам анбор шудаанд, то як рӯз, ба маҳзи инки фурсаташро пайдо кардед ба суроғи онҳо биравед, ғарқ шудаед.Ҳеч маҳдудияте дар мавриди ончи метавонед анҷом би¬ди¬ҳед, вуҷуд нахоҳад дошт ба шарте ки ёд бигиред чи тавр: қурбоққаро қурт бидиҳед.',
            //13
            'Китобе, Ойини дӯстёбӣ (ва рамзи нуфуз дар мардум) як манбаи олӣ барои омӯзиш аст. Омӯзиши маҳоратҳои дӯстёбӣ, тарзи сухан гуфтан ва ҳунари нуфуз дар дигарон. Ҷолиб инҷост, ки Дейл Каранеги соли 1955 яъне 66 сол пеш (ҳоло 2021 ҳаст) фавт карда-аст ва ин китобро ҳам 85 сол қабл навиш¬тааст, ҳанӯз ҳам омӯзишҳои ин китоб зарурӣ аст.',
            //14 
            'Муҳаммадзамони Солеҳ аз зумраи адибони соҳибҳунар ва тозаназар аст. Романи таърихии ӯ “Девори Хуросон” маҷмӯи корномаҳои ҷовидонии бунёд-гузори давлати Сомониён Амир Исмоили Сомонӣ мебошад. Муаллиф пиромуни образи ин шоҳи одил мушкилот ва муаммоҳои зиндагии иҷтимоии мардуми тоҷикро андар офариниши як давлати бузурги миллӣ бо тамоми суннатҳои қадимӣ ва таърихиаш мавриди такмилу тасвири хоса қарор додааст',
        ];

        $price = [0,0,80,20,0,0,40,0,0,0,0,0,0,0,0,0,0,0];

        for($i = 0; $i < count($books); $i++) {
            $b = new Book();
            $b->title = $books[$i];
            $b->slug = Helper::generateUniqueSlug($books[$i], Book::class);
            $b->price = $price[$i];
            $b->description = $descriptions[$i];
            $b->image = Helper::generateUniqueSlug($books[$i], Book::class) . '.jpg';
            $b->filename = Helper::generateUniqueSlug($books[$i], Book::class) . '.pdf';
            $b->publisher = 'ООО Ориёнфарм';
            $b->publish_year = rand(1990, 2021);
            $b->pages = rand(4, 80);
            $b->most_readable = true;
            $b->views = rand(0, 100);
            if($i == 1 || $i == 2 || $i == 3 || $i == 5)
                $b->most_readable = false;    
            $b->save();
            $b->categories()->attach(rand(1, 12));
            $b->categories()->attach(rand(13, 20));
            if($i > 9) {
                $b->authors()->attach(rand(1,9));
            } else {
                $b->authors()->attach($i+1);
            }
        }




    }
}
