@extends('layouts.app')
@section('main')

@section('title', 'Политика конфиденциальности')

<div class="main__inner app-privacy-policy-page">
    <section class="app-privacy-policy-section">
        <div class="app-privacy-policy-section__inner main-container">
            <h1 class="main-title app-privacy-policy-title">Политика конфиденциальности для приложения Маркази Хирад</h1>

            <div class="app-privacy-policy-text">
                <p><strong>Сбор и использование информации:</strong></p>
                <p>Мы собираем только необходимую информацию для обеспечения функциональности приложения. Это включает в себя данные о пользователях, такие как имя, адрес электронной почты и данные
                    платежей для обработки заказов.</p>
                <p><strong>Хранение данных:</strong></p>
                <p>Ваши личные данные хранятся с максимальной безопасностью. Мы принимаем все необходимые меры для защиты от несанкционированного доступа, изменения или раскрытия.</p>
                <p><strong>Использование информации:</strong></p>
                <p>Мы используем ваши данные только для обработки заказов, обеспечения безупречной работы приложения и улучшения пользовательского опыта. Никакая личная информация не будет передана
                    третьим сторонам без вашего согласия.</p>
                <p><strong>Платежи:</strong></p>
                <p>ля обработки платежей мы сотрудничаем с надежными платежными провайдерами. Ваши финансовые данные обрабатываются в соответствии с их политикой конфиденциальности.</p>
                <p><strong>Безопасность:</strong></p>
                <p>Мы прилагаем все усилия для обеспечения безопасности ваших данных. Тем не менее, помните, что ни один метод передачи данных через интернет или метод электронного хранения не
                    является 100% надежным.</p>
                <p><strong>Обновления политики конфиденциальности:</strong></p>
                <p>Мы оставляем за собой право время от времени обновлять эту политику конфиденциальности. Изменения вступают в силу с момента их размещения в приложении.</p>
                <p><strong>Ваше согласие:</strong></p>
                <p>Используя приложение <strong>Маркази Хирад</strong>, вы соглашаетесь с условиями нашей политики конфиденциальности.</p>
                <p>Если у вас есть какие-либо вопросы или требуется дополнительная информация, свяжитесь с нами по адресу <strong><a
                            href="mailto:markazikhirad@gmail.com">markazikhirad@gmail.com</a></strong>.</p>
            </div>
        </div>
    </section>
</div>



@endsection
